#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/semaphore.h>
#include <nuttx/i2c/i2c_master.h>

#include <arch/board/board.h>

#include "hardware/sg2002_mmio.h"
#include "sg200x.h"

#define SG2002_Priv_2_BaseReg(x)            (volatile sg2002_i2c_reg_TypeDef *)((uintptr_t)(x));

#define SG2002_Enable_Reg                   volatile SG2002_IC_ENABLE_Reg_TypeDef
#define SG2002_EnableStatus_Reg             volatile SG2002_IC_ENABLE_STATUS_Reg_TypeDef
#define SG2002_Status_Reg                   volatile SG2002_IC_STATUS_Reg_TypeDef
#define SG2002_Con_Reg                      volatile SG2002_IC_CON_Reg_TypeDef
#define SG2002_Hs_Scl_Hcnt_Reg              volatile SG2002_IC_HS_SCL_HCNT_Reg_TypeDef
#define SG2002_Hs_Scl_Lcnt_Reg              volatile SG2002_IC_HS_SCL_LCNT_Reg_TypeDef
#define SG2002_Ss_Scl_Hcnt_Reg              volatile SG2002_IC_SS_SCL_HCNT_Reg_TypeDef
#define SG2002_Ss_Scl_Lcnt_Reg              volatile SG2002_IC_SS_SCL_LCNT_Reg_TypeDef
#define SG2002_Fs_Scl_Hcnt_Reg              volatile SG2002_IC_FS_SCL_HCNT_Reg_TypeDef
#define SG2002_Fs_Scl_Lcnt_Reg              volatile SG2002_IC_FS_SCL_LCNT_Reg_TypeDef
#define SG2002_Tar_Reg                      volatile SG2002_IC_TAR_Reg_TypeDef

#define SG2002_Clr_Start_Det_Reg            volatile SG2002_IC_CLR_START_DET_Reg_TypeDef
#define SG2002_Clr_Gen_Call_Reg             volatile SG2002_IC_CLR_GEN_CALL_Reg_TypeDef
 
#define To_SG2002_Enable_Reg_Ptr(x)         ((SG2002_Enable_Reg         *)((uintptr_t)&(x)))
#define To_SG2002_EnableStatus_Reg_Ptr(x)   ((SG2002_EnableStatus_Reg   *)((uintptr_t)&(x)))
#define To_SG2002_Status_Reg_Ptr(x)         ((SG2002_Status_Reg         *)((uintptr_t)&(x)))
#define To_SG2002_Con_Reg_Ptr(x)            ((SG2002_Con_Reg            *)((uintptr_t)&(x)))
#define To_SG2002_Hs_Scl_Hcnt_Reg_Ptr(x)    ((SG2002_Hs_Scl_Hcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Hs_Scl_Lcnt_Reg_Ptr(x)    ((SG2002_Hs_Scl_Lcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Ss_Scl_Hcnt_Reg_Ptr(x)    ((SG2002_Ss_Scl_Hcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Ss_Scl_Lcnt_Reg_Ptr(x)    ((SG2002_Ss_Scl_Lcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Fs_Scl_Hcnt_Reg_Ptr(x)    ((SG2002_Fs_Scl_Hcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Fs_Scl_Lcnt_Reg_Ptr(x)    ((SG2002_Fs_Scl_Lcnt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Tar_Reg_Ptr(x)            ((SG2002_Tar_Reg            *)((uintptr_t)&(x)))
#define To_SG2002_Data_Cmd_Reg_Ptr(x)       ((SG2002_Data_Cmd_Reg       *)((uintptr_t)&(x)))
#define To_SG2002_Raw_Intr_Stat_Reg_Ptr(x)  ((SG2002_Raw_Intr_Stat_Reg  *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Stop_Det_Reg_Ptr(x)   ((SG2002_Clr_Stop_Det_Reg   *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Intr_Reg_Ptr(x)       ((SG2002_Clr_Intr_Reg       *)((uintptr_t)&(x)))
#define To_SG2002_RxFlr_Reg_Ptr(x)          ((SG2002_RxFlr_Reg          *)((uintptr_t)&(x)))
#define To_SG2002_TxFlr_Reg_Ptr(x)          ((SG2002_TxFlr_Reg          *)((uintptr_t)&(x)))
#define To_SG2002_Intr_Mask_Reg_Ptr(x)      ((SG2002_Intr_Mask_Reg      *)((uintptr_t)&(x)))
#define To_SG2002_Intr_Stat_Reg_Ptr(x)      ((SG2002_Intr_Stat_Reg      *)((uintptr_t)&(x)))
#define To_SG2002_Rx_Tl_Reg_Ptr(x)          ((SG2002_Rx_Tl_Reg          *)((uintptr_t)&(x)))
#define To_SG2002_Tx_Tl_Reg_Ptr(x)          ((SG2002_Tx_Tl_Reg          *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Rx_Under_Reg_Ptr(x)   ((SG2002_Clr_Rx_Under_Reg   *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Rx_Over_Reg_Ptr(x)    ((SG2002_Clr_Rx_Over_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Tx_Over_Reg_Ptr(x)    ((SG2002_Clr_Tx_Over_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Rd_Req_Reg_Ptr(x)     ((SG2002_Clr_Rd_Req_Reg     *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Tx_Abrt_Reg_Ptr(x)    ((SG2002_Clr_Tx_Abrt_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Rx_Done_Reg_Ptr(x)    ((SG2002_Clr_Rx_Done_Reg    *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Activity_Reg_Ptr(x)   ((SG2002_Clr_Activity_Reg   *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Start_Det_Reg_Ptr(x)  ((SG2002_Clr_Start_Det_Reg  *)((uintptr_t)&(x)))
#define To_SG2002_Clr_Gen_Call_Reg_Ptr(x)   ((SG2002_Clr_Gen_Call_Reg   *)((uintptr_t)&(x)))

#define reg_t volatile uint32_t

typedef struct {
	reg_t ic_con;               /* 0x00 */
	reg_t ic_tar;               /* 0x04 */
	reg_t ic_sar;               /* 0x08 */
	reg_t ic_hs_maddr;          /* 0x0c */
	reg_t ic_data_cmd;          /* 0x10 */
	reg_t ic_ss_scl_hcnt;       /* 0x14 */
	reg_t ic_ss_scl_lcnt;       /* 0x18 */
	reg_t ic_fs_scl_hcnt;       /* 0x1c */
	reg_t ic_fs_scl_lcnt;       /* 0x20 */
	reg_t ic_hs_scl_hcnt;       /* 0x24 */
	reg_t ic_hs_scl_lcnt;       /* 0x28 */
	reg_t ic_intr_stat;         /* 0x2c */
	reg_t ic_intr_mask;         /* 0x30 */
	reg_t ic_raw_intr_stat;     /* 0x34 */
	reg_t ic_rx_tl;             /* 0x38 */
	reg_t ic_tx_tl;             /* 0x3c */
	reg_t ic_clr_intr;          /* 0x40 */
	reg_t ic_clr_rx_under;      /* 0x44 */
	reg_t ic_clr_rx_over;       /* 0x48 */
	reg_t ic_clr_tx_over;       /* 0x4c */
	reg_t ic_clr_rd_req;        /* 0x50 */
	reg_t ic_clr_tx_abrt;       /* 0x54 */
	reg_t ic_clr_rx_done;       /* 0x58 */
	reg_t ic_clr_activity;      /* 0x5c */
	reg_t ic_clr_stop_det;	    /* 0x60 */
	reg_t ic_clr_start_det;     /* 0x64 */
	reg_t ic_clr_gen_call;      /* 0x68 */
	reg_t ic_enable;            /* 0x6c */
	reg_t ic_status;            /* 0x70 */
	reg_t ic_txflr;             /* 0x74 */
	reg_t ic_rxflr;	            /* 0x78 */
	reg_t ic_sda_hold;          /* 0x7c */
	reg_t ic_tx_abrt_source;	/* 0x80 */
	reg_t ic_slv_dat_nack_only; /* 0x84 */
	reg_t ic_dma_cr; 		    /* 0x88 */
	reg_t ic_dma_tdlr;	        /* 0x8c */
	reg_t ic_dma_rdlr;	        /* 0x90 */
	reg_t ic_sda_setup;	        /* 0x94 */
	reg_t ic_ack_general_call;  /* 0x98 */
	reg_t ic_enable_status;	    /* 0x9c */
	reg_t ic_fs_spklen;	        /* 0xa0 */
	reg_t ic_hs_spklen;	        /* 0xa4 */
} sg2002_i2c_reg_TypeDef;

struct sg2002_i2c_config_s {
    uint32_t base;                          /* I2C base address */
    uint32_t irq;                           /* I2C IRQ */
};

/* I2C Device Private Data */

struct sg2002_i2c_priv_s {
    /* Standard I2C operations */
    const struct i2c_ops_s *ops;

    /* Port configuration */
    const struct sg2002_i2c_config_s *config;
    
    int refs;                               /* Reference count */
    sem_t sem_excl;                         /* Mutual exclusion semaphore */
    sem_t sem_isr;                          /* Interrupt wait semaphore */

    uint8_t msgc;                           /* Message count */
    struct i2c_msg_s *msgv;                 /* Message list */
    uint8_t *ptr;                           /* Current message buffer */
    int dcnt;                               /* Current message length */
    uint16_t flags;                         /* Current message flags */

